//---------------------------------------------------------------------------

#pragma hdrstop

#include "DelHeader.h"

//---------------------------------------------------------------------------
DelHeader::DelHeader()
{

}
//---------------------------------------------------------------------------
DelHeader::~DelHeader()
{

}
//---------------------------------------------------------------------------
void DelHeader::Delete(TStringList *sl)
{
    // алгоритм удаления колонтитулов
    sl->Strings[0] = "Алгоритм удаления колонтитулов";
}
//---------------------------------------------------------------------------
#pragma package(smart_init)
