/*______________________________ AlgArtefact.cpp ________________________________ */
/**
    \file       AlgArtefact.cpp
    \brief      Класс структуризации текста по артефактам
    \author     Шепшелевич П.И. , Березин А.Е.
    \version    1.0
    \date       18.11.2015
    \note
    \remarks
    \par
    \code
        18/11/2015 – 1.0 – создание класса.
    \endcode
*/
//---------------------------------------------------------------------------

#pragma hdrstop

#include "AlgArtefact.h"

//---------------------------------------------------------------------------
AlgArtefact::AlgArtefact()
{

}
//---------------------------------------------------------------------------
AlgArtefact::~AlgArtefact()
{

}
//---------------------------------------------------------------------------
void AlgArtefact::AlgStruct(TStringList *sl)
{
    // алгоритм структуризации по артефактам
    sl->Strings[0] = "Алгоритм структуризации по артефактам";
}
//---------------------------------------------------------------------------
#pragma package(smart_init)
