//---------------------------------------------------------------------------

#pragma hdrstop

#include "AlgArtefact.h"

//---------------------------------------------------------------------------
AlgArtefact::AlgArtefact()
{

}
//---------------------------------------------------------------------------
AlgArtefact::~AlgArtefact()
{

}
//---------------------------------------------------------------------------
void AlgArtefact::AlgStruct(TStringList *sl)
{
    // алгоритм структуризации по артефактам
    sl->Strings[0] = "Алгоритм структуризации по артефактам";
}
//---------------------------------------------------------------------------
#pragma package(smart_init)
