//---------------------------------------------------------------------------

#pragma hdrstop

#include "AlgContent.h"

//---------------------------------------------------------------------------
AlgContent::AlgContent()
{

}
//---------------------------------------------------------------------------
AlgContent::~AlgContent()
{

}
//---------------------------------------------------------------------------
void AlgContent::AlgStruct(TStringList *sl)
{
    // алгоритм структуризации по оглавлению
    sl->Strings[0] = "Алгоритм структуризации по оглавлению";
}
//---------------------------------------------------------------------------
#pragma package(smart_init)
