//---------------------------------------------------------------------------

#pragma hdrstop

#include "AlgContent.h"

//---------------------------------------------------------------------------
AlgContent::AlgContent()
{

}
//---------------------------------------------------------------------------
AlgContent::~AlgContent()
{

}
//---------------------------------------------------------------------------
void AlgContent::AlgStruct(TStringList *sl)
{
    // алгоритм структуризации по оглавлению
    sl->Strings[0] = "Алгоритм структуризации по оглавлению";
}
// Функция замены строк в массиве строк
void AlgContent::new_Exchange(int num, String new1)
{
    text->Add(new1);          //добавление строки в конец массива строк
    int num1 = text->Count;   //получение количества строк
    --num1;                        //установка номера последней строки (нумерация с 0)
    text->Exchange(num,num1); //замена строк - последняя становится выделенной, выделенная - последней
    text->Delete(num1);       //удаление последней строки
}
//---------------------------------------------------------------------------
#pragma package(smart_init)
