/*______________________________ DelHeader.cpp ________________________________ */
/**
    \file       DelHeader.cpp
    \brief      Класс удаления колонтитулов в тексте
    \author     Шепшелевич П.И. , Березин А.Е.
    \version    1.0
    \date       18.11.2015
    \note
    \remarks
    \par
    \code
        18/11/2015 – 1.0 – работа над алгоритмом.
    \endcode
*/
//---------------------------------------------------------------------------

#pragma hdrstop

#include "DelHeader.h"

//---------------------------------------------------------------------------
DelHeader::DelHeader()
{

}
//---------------------------------------------------------------------------
DelHeader::~DelHeader()
{

}
//---------------------------------------------------------------------------
void DelHeader::Delete(TStringList *sl)
{
    // алгоритм удаления колонтитулов
    sl->Strings[0] = "Алгоритм удаления колонтитулов";
}
//---------------------------------------------------------------------------
#pragma package(smart_init)
