/*______________________________ DelPage.cpp ________________________________ */
/**
    \file       DelPage.h
    \brief      Класс удаления номеров страниц в тексте
    \author     Шепшелевич П.И. , Березин А.Е.
    \version    1.0
    \date       18.11.2015
    \note
    \remarks
    \par
    \code
        18/11/2015 – 1.0 – работа над алгоритмом.
    \endcode
*/
//---------------------------------------------------------------------------

#pragma hdrstop

#include "DelPage.h"

//---------------------------------------------------------------------------
DelPage::DelPage(TStringList *sl)
{
    text = sl;
}
//---------------------------------------------------------------------------
DelPage::~DelPage()
{

}
//---------------------------------------------------------------------------
void DelPage::Delete()
{
    // алгоритм удаления номеров страниц
    text->Strings[0] = "Алгоритм удаления номеров страниц";
}
//---------------------------------------------------------------------------
#pragma package(smart_init)
