/*______________________________ DelTop.ccp ________________________________ */
/**
    \file       DelTop.ccp
    \brief      Класс удаления текста перед содержанием
    \author     Шепшелевич П.И. , Березин А.Е.
    \version    1.1
    \date       18.11.2015
    \note
    \remarks
    \par
    \code
        18/11/2015 – 1.0 – создание класса;
        18/11/2015 – 1.1 – работа над алгоритмом.
    \endcode
*/
//---------------------------------------------------------------------------
#pragma hdrstop

#include "DelTop.h"
//---------------------------------------------------------------------------
DelTop::DelTop()
{

}
//---------------------------------------------------------------------------
DelTop::~DelTop()
{

}
void DelTop::Delete(TStringList *sl)
{
    //
}
//---------------------------------------------------------------------------
#pragma package(smart_init)
